Revit 2027 API
ViewSheet.IsPlaceholder Property
 Identifies whether or not the view sheet represents a placeholder sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPlaceholder { get; }
Public ReadOnly Property IsPlaceholder As Boolean
	Get
public:
property bool IsPlaceholder {
	bool get ();
}
member IsPlaceholder : bool with get
Property Value
Boolean
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace